## Terraform Plan (dev)

<details><summary>Show plan</summary>

```terraform
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/aws/apigateway/surfaced-art-dev-api]
aws_ecr_repository.migrate: Refreshing state... [id=surfaced-art-dev-migrate]
aws_ecr_repository.image_processor: Refreshing state... [id=surfaced-art-dev-image-processor]
module.cognito.data.aws_region.current: Reading...
aws_ecr_repository.api: Refreshing state... [id=surfaced-art-dev-api]
module.iam.aws_iam_role.lambda_execution: Refreshing state... [id=surfaced-art-dev-lambda-role]
module.cognito.data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_vpc.default: Reading...
module.s3_cloudfront.aws_s3_bucket.media: Refreshing state... [id=surfaced-art-dev-media]
module.s3_cloudfront.aws_cloudfront_response_headers_policy.security: Refreshing state... [id=c68feaa8-b67a-4eba-91a4-c65656f9bdd6]
module.cognito.aws_cognito_user_pool.main: Refreshing state... [id=us-east-1_gGaXELaYj]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=174497891311]
module.s3_cloudfront.aws_cloudfront_origin_access_control.media: Refreshing state... [id=E2UWGTK5XYZJ8N]
aws_sns_topic.platform_alerts: Refreshing state... [id=arn:aws:sns:us-east-1:174497891311:surfaced-art-dev-platform-alerts]
data.aws_iam_policy_document.ecr_lambda: Reading...
data.aws_iam_policy_document.ecr_lambda: Read complete after 0s [id=3882666715]
aws_ecr_lifecycle_policy.image_processor: Refreshing state... [id=surfaced-art-dev-image-processor]
aws_ecr_repository_policy.image_processor: Refreshing state... [id=surfaced-art-dev-image-processor]
aws_ecr_lifecycle_policy.migrate: Refreshing state... [id=surfaced-art-dev-migrate]
aws_ecr_lifecycle_policy.api: Refreshing state... [id=surfaced-art-dev-api]
aws_ecr_repository_policy.migrate: Refreshing state... [id=surfaced-art-dev-migrate]
aws_ecr_repository_policy.api: Refreshing state... [id=surfaced-art-dev-api]
module.lambda_api.aws_apigatewayv2_api.main: Refreshing state... [id=shufg1wnqa]
aws_sns_topic_subscription.alert_email: Refreshing state... [id=arn:aws:sns:us-east-1:174497891311:surfaced-art-dev-platform-alerts:85ac25b4-0c3a-4ae6-88ca-392f7a586c1e]
module.iam.aws_iam_role_policy.lambda_cloudwatch: Refreshing state... [id=surfaced-art-dev-lambda-role:surfaced-art-dev-lambda-cloudwatch]
module.iam.aws_iam_role_policy.lambda_vpc: Refreshing state... [id=surfaced-art-dev-lambda-role:surfaced-art-dev-lambda-vpc]
module.cognito.aws_cognito_user_pool_domain.main: Refreshing state... [id=surfaced-art-dev]
module.iam.aws_iam_role_policy.lambda_ecr: Refreshing state... [id=surfaced-art-dev-lambda-role:surfaced-art-dev-lambda-ecr]
module.cognito.aws_cognito_identity_provider.google[0]: Refreshing state... [id=us-east-1_gGaXELaYj:Google]
module.lambda_image_processor.aws_lambda_function.image_processor: Refreshing state... [id=surfaced-art-dev-image-processor]
data.aws_vpc.default: Read complete after 1s [id=vpc-f169728a]
data.aws_subnets.default: Reading...
module.lambda_api.aws_security_group.lambda: Refreshing state... [id=sg-0d00c4acee99ac83d]
module.lambda_migrate.aws_security_group.migrate: Refreshing state... [id=sg-0bb9de0a06b139f8d]
module.cognito.aws_cognito_user_pool_client.main: Refreshing state... [id=1tgmh020eg73ppt5iv3ugk6ku0]
module.lambda_api.aws_apigatewayv2_stage.main: Refreshing state... [id=$default]
aws_cloudwatch_metric_alarm.api_gateway_5xx: Refreshing state... [id=surfaced-art-dev-api-gateway-5xx]
data.aws_subnets.default: Read complete after 0s [id=us-east-1]
module.rds.aws_db_subnet_group.main: Refreshing state... [id=surfaced-art-dev-db-subnet]
module.lambda_api.aws_apigatewayv2_authorizer.jwt: Refreshing state... [id=00d87o]
module.rds.aws_security_group.rds: Refreshing state... [id=sg-0d93a245557a466b6]
aws_cloudwatch_log_group.image_processor_lambda: Refreshing state... [id=/aws/lambda/surfaced-art-dev-image-processor]
aws_cloudwatch_dashboard.image_processor_logs: Refreshing state... [id=surfaced-art-dev-image-processor-logs]
module.s3_cloudfront.aws_s3_bucket_cors_configuration.media: Refreshing state... [id=surfaced-art-dev-media]
module.s3_cloudfront.aws_s3_bucket_versioning.media: Refreshing state... [id=surfaced-art-dev-media]
module.lambda_image_processor.aws_lambda_permission.s3_invoke: Refreshing state... [id=AllowS3Invoke]
module.s3_cloudfront.aws_s3_bucket_public_access_block.media: Refreshing state... [id=surfaced-art-dev-media]
module.iam.aws_iam_role_policy.lambda_s3: Refreshing state... [id=surfaced-art-dev-lambda-role:surfaced-art-dev-lambda-s3]
module.s3_cloudfront.aws_s3_bucket_server_side_encryption_configuration.media: Refreshing state... [id=surfaced-art-dev-media]
module.s3_cloudfront.aws_cloudfront_distribution.media: Refreshing state... [id=E2RSQ2FUN6KPGL]
module.rds.aws_db_instance.main: Refreshing state... [id=db-6IMOESMIXP4SYEZD5P3KV44ELQ]
module.lambda_image_processor.aws_s3_bucket_notification.image_upload: Refreshing state... [id=surfaced-art-dev-media]
aws_cloudwatch_metric_alarm.rds_connections: Refreshing state... [id=surfaced-art-dev-rds-connection-count]
module.s3_cloudfront.aws_s3_bucket_policy.media: Refreshing state... [id=surfaced-art-dev-media]
aws_cloudwatch_metric_alarm.rds_free_storage: Refreshing state... [id=surfaced-art-dev-rds-low-storage]
module.lambda_api.aws_lambda_function.api: Refreshing state... [id=surfaced-art-dev-api]
module.lambda_migrate.aws_lambda_function.migrate: Refreshing state... [id=surfaced-art-dev-migrate]
aws_cloudwatch_log_group.migrate_lambda: Refreshing state... [id=/aws/lambda/surfaced-art-dev-migrate]
module.lambda_api.aws_lambda_permission.api_gateway: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_cloudwatch_log_group.api_lambda: Refreshing state... [id=/aws/lambda/surfaced-art-dev-api]
aws_cloudwatch_dashboard.platform: Refreshing state... [id=surfaced-art-dev-platform]
aws_cloudwatch_metric_alarm.api_lambda_errors: Refreshing state... [id=surfaced-art-dev-api-lambda-errors]
module.lambda_api.aws_apigatewayv2_integration.lambda: Refreshing state... [id=jkujdpd]
aws_cloudwatch_metric_alarm.api_lambda_duration: Refreshing state... [id=surfaced-art-dev-api-lambda-duration-p95]
module.lambda_api.aws_apigatewayv2_route.protected["admin_patch"]: Refreshing state... [id=oz7ohs9]
module.lambda_api.aws_apigatewayv2_route.catch_all: Refreshing state... [id=wjyii0v]
module.lambda_api.aws_apigatewayv2_route.protected["uploads_put"]: Refreshing state... [id=90b6wpo]
module.lambda_api.aws_apigatewayv2_route.protected["me_get"]: Refreshing state... [id=pw0vfuo]
module.lambda_api.aws_apigatewayv2_route.protected["admin_get"]: Refreshing state... [id=z4jcphi]
module.lambda_api.aws_apigatewayv2_route.protected["auth_post"]: Refreshing state... [id=ljr4twa]
module.lambda_api.aws_apigatewayv2_route.protected["admin_delete"]: Refreshing state... [id=e0yrb0n]
module.lambda_api.aws_apigatewayv2_route.protected["uploads_get"]: Refreshing state... [id=eahlm1s]
module.lambda_api.aws_apigatewayv2_route.protected["auth_delete"]: Refreshing state... [id=p87k5kv]
module.lambda_api.aws_apigatewayv2_route.protected["auth_patch"]: Refreshing state... [id=e5v1px1]
module.lambda_api.aws_apigatewayv2_route.protected["auth_get"]: Refreshing state... [id=q6hjfcp]
module.lambda_api.aws_apigatewayv2_route.protected["admin_put"]: Refreshing state... [id=ydye81e]
module.lambda_api.aws_apigatewayv2_route.protected["me_post"]: Refreshing state... [id=rc7dvkd]
module.lambda_api.aws_apigatewayv2_route.protected["uploads_post"]: Refreshing state... [id=1fsz3wr]
module.lambda_api.aws_apigatewayv2_route.protected["uploads_patch"]: Refreshing state... [id=8kochtg]
module.lambda_api.aws_apigatewayv2_route.protected["auth_put"]: Refreshing state... [id=iryfx3c]
module.lambda_api.aws_apigatewayv2_route.protected["me_delete"]: Refreshing state... [id=12x7z0a]
module.lambda_api.aws_apigatewayv2_route.protected["me_patch"]: Refreshing state... [id=0u5jyu4]
module.lambda_api.aws_apigatewayv2_route.protected["admin_post"]: Refreshing state... [id=wn5ei6g]
module.lambda_api.aws_apigatewayv2_route.protected["uploads_delete"]: Refreshing state... [id=oqdq1e4]
module.lambda_api.aws_apigatewayv2_route.protected["me_put"]: Refreshing state... [id=xhr0ih5]
aws_cloudwatch_dashboard.api_logs: Refreshing state... [id=surfaced-art-dev-api-logs]
module.s3_cloudfront.aws_s3_bucket_lifecycle_configuration.media: Refreshing state... [id=surfaced-art-dev-media]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_sns_topic_subscription.alert_email must be replaced
-/+ resource "aws_sns_topic_subscription" "alert_email" {
      ~ arn                             = "arn:aws:sns:us-east-1:174497891311:surfaced-art-dev-platform-alerts:85ac25b4-0c3a-4ae6-88ca-392f7a586c1e" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = (sensitive value) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:174497891311:surfaced-art-dev-platform-alerts:85ac25b4-0c3a-4ae6-88ca-392f7a586c1e" -> (known after apply)
      ~ owner_id                        = "174497891311" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.cognito.aws_cognito_identity_provider.google[0] will be updated in-place
  ~ resource "aws_cognito_identity_provider" "google" {
        id                = "us-east-1_gGaXELaYj:Google"
      ~ provider_details  = {
          - "attributes_url"                = "https://people.googleapis.com/v1/people/me?personFields=" -> null
          - "attributes_url_add_attributes" = "true" -> null
          - "authorize_url"                 = "https://accounts.google.com/o/oauth2/v2/auth" -> null
          ~ "client_id"                     = (sensitive value)
          ~ "client_secret"                 = (sensitive value)
          - "oidc_issuer"                   = "https://accounts.google.com" -> null
          - "token_request_method"          = "POST" -> null
          - "token_url"                     = "https://www.googleapis.com/oauth2/v4/token" -> null
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.lambda_api.aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "surfaced-art-dev-api"
        tags                           = {
            "Name" = "surfaced-art-dev-api"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DATABASE_URL"            = (sensitive value)
              ~ "POSTMARK_SERVER_TOKEN"   = (sensitive value)
              ~ "STRIPE_SECRET_KEY"       = (sensitive value)
              ~ "STRIPE_WEBHOOK_SECRET"   = (sensitive value)
                # (10 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_migrate.aws_lambda_function.migrate will be updated in-place
  ~ resource "aws_lambda_function" "migrate" {
        id                             = "surfaced-art-dev-migrate"
        tags                           = {
            "Name" = "surfaced-art-dev-migrate"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DATABASE_URL"        = (sensitive value)
                # (5 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.rds.aws_db_instance.main will be updated in-place
  ~ resource "aws_db_instance" "main" {
        id                                    = "db-6IMOESMIXP4SYEZD5P3KV44ELQ"
      ~ password                              = (sensitive value)
        tags                                  = {
            "Name" = "surfaced-art-dev-db"
        }
        # (59 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.

Warning: Deprecated attribute

  on modules/cognito/outputs.tf line 18, in output "domain":
  18:   value       = "https://${aws_cognito_user_pool_domain.main.domain}.auth.${data.aws_region.current.name}.amazoncognito.com"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

Plan generated from commit 002c984.